app/controllers/resumes_controller.rb

  def index
    @resumes = Resume.all
---
SELECT "resumes".* FROM "resumes"

  def create
    @resume = Resume.new(resume_params)

    respond_to do |format|
      if @resume.save
---
INSERT INTO "resumes" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-10-27 15:17:57.981161"], ["updated_at", "2019-10-27 15:17:57.981161"]]

  def destroy
    @resume.destroy
---
DELETE FROM "resumes" WHERE "resumes"."id" = ?  [["id", 1]]

    def set_resume
      @resume = Resume.find(params[:id])
---
SELECT "resumes".* FROM "resumes" WHERE "resumes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]